// data.js

// 使用全局变量 window.goalData 来存储你的目标数据
window.goalData = {
    "7年大目标": {
        "时段": "2025 - 2032",
        "总体进度": "0%",
        "详情": [
            {
                "目标": "存款超过100万",
                "累计完成": "0/100"
            },
            {
                "目标": "阅读书籍累计300本书",
                "累计完成": "95/300"
            },
            {
                "目标": "健身500次",
                "累计完成": "0/500"
            }
        ]
    },
    "年度目标": [
        {
            "年份": "2025",
            "年度进度": "15%",
            "目标": [
                { "名称": "阅读40本书", "完成情况": "6本" },
                { "名称": "每天读书1小时", "完成情况": "51" },
                { "名称": "存钱5万", "完成情况": "0万" },
                { "名称": "健身150次", "完成情况": "0次" },
                { "名称": "坚持做该做的事情，学会积累，然后好好体验生活中的新鲜事物，好好生活，让生活过得更火热一点。", "完成情况": "无" }
            ]
        }
    ],
    "2025年目标详细进度": [
        {
            "目标": "阅读40本书",
            "已完成": "6本",
            "进度": "15%"
        },
        {
            "目标": "每天读书1小时",
            "已完成": "51",
            "进度": "14%"
        },
        {
            "目标": "存钱5万",
            "已存": "0",
            "进度": "0%"
        },
        {
            "目标": "健身150次",
            "已完成": "0次",
            "进度": "0%"
        },
        {
            "目标": "坚持做该做的事情，学会积累，然后好好体验生活中的新鲜事物，好好生活，让生活过得更火热一点。",
            "已完成": "无",
            "进度": "无"
        }
    ]
};
